In [1]:
import pandas as pd
df= pd.read_csv("test.csv")
print(df)
df.info()

   roll   name   age     address
0     1    ram  22.0      dharan
1     2  shyam   NaN  biratnagar
2     3    NaN   NaN     itahari
3     4   sita   NaN    janakpur
<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   roll     4 non-null      int64
 1   name     3 non-null      str
 2   age      1 non-null      float64
 3   address  4 non-null      str
dtypes: float64(1), int64(1), str(2)
memory usage: 260.0 bytes

In [2]:
df.shape

(4, 4)

In [3]:
df2=df.dropna()
df2

   roll name   age address
0     1  ram  22.0  dharan

In [4]:
df3=df.dropna(axis=1)
df3

   roll     address
0     1      dharan
1     2  biratnagar
2     3     itahari
3     4    janakpur

In [5]:
df

   roll   name   age     address
0     1    ram  22.0      dharan
1     2  shyam   NaN  biratnagar
2     3    NaN   NaN     itahari
3     4   sita   NaN    janakpur

In [6]:
#fill missing values in age column with the mean
df["age"]=df['age'].fillna(df["age"].mean())
df.head()

   roll   name   age     address
0     1    ram  22.0      dharan
1     2  shyam  22.0  biratnagar
2     3    NaN  22.0     itahari
3     4   sita  22.0    janakpur

In [7]:
df["name"]=df["name"].fillna("unknown")
df.head

<bound method NDFrame.head of    roll     name   age     address
0     1      ram  22.0      dharan
1     2    shyam  22.0  biratnagar
2     3  unknown  22.0     itahari
3     4     sita  22.0    janakpur>